Revit 2027 API
AdvancedWood.WoodGrowthPerlinEnable Property
 The property labeled "Use perlin noise for ring growth" from the "AdvancedWood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WoodGrowthPerlinEnable { get; }
Public Shared ReadOnly Property WoodGrowthPerlinEnable As String
	Get
public:
static property String^ WoodGrowthPerlinEnable {
	String^ get ();
}
static member WoodGrowthPerlinEnable : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyBoolean".
See Also
Reference
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace